# GetNumberOfDLComponents

## Description
Gets the number of components in the Double Line Preferences.

```pascal
FUNCTION GetNumberOfDLComponents(VAR numComponents : INTEGER) : BOOLEAN;
```

```python

def vs.GetNumberOfDLComponents():
    return (BOOLEAN, numComponents)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|numComponents|INTEGER|Returns the number of components.|

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings